bierner.markdown-mermaid
christian-kohler.path-intellisense
eamodio.gitlens
github.copilot
github.copilot-chat
github.remotehub
google.gemini-cli-vscode-ide-companion
google.geminicodeassist
googlecloudtools.cloudcode
grapecity.gc-excelviewer
hashicorp.terraform
jock.svg
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.isort
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-repos
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
njpwerner.autodocstring
ritwickdey.liveserver
saoudrizwan.claude-dev
tamasfe.even-better-toml
tomoki1207.pdf
